// bolo - public domain Tzvetan Mikov 2021
// A modern C/C++ reimplementation of the classic Apple II Game BOLO (1982)
// https://en.wikipedia.org/wiki/Bolo_(1982_video_game)
//
// The reimplementation is based on the unofficial 1993 IBM PC port of the
// original game by Mr.Rm. Unfortunately almost nothing is known about that
// port, or the mysterious "Mr.Rm", but it appears to be a completely faithful
// reimplementation.

#include "sokol_app.h"
#include "sokol_audio.h"
#include "sokol_gfx.h"
#include "sokol_glue.h"
#include "sokol_time.h"

#include "blit.h"

#include <assert.h>
#include <stdalign.h>
#include <stdatomic.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

typedef enum EGAColor {
  EGABlack = 0,
  EGALowBlue = 1,
  EGALowGreen = 2,
  EGALowCyan = 3,
  EGALowRed = 4,
  EGALowMagenta = 5,
  EGABrown = 6,
  EGALightGray = 7,
  EGADarkGray = 8,
  EGAHighBlue = 9,
  EGAHighGreen = 10,
  EGAHighCyan = 11,
  EGAHighRed = 12,
  EGAHighMagenta = 13,
  EGAYellow = 14,
  EGAWhite = 15,
} EGAColor;

#define EGA_WIDTH 320
#define EGA_STRIDE 40
#define EGA_HEIGHT 200
#define EGA_PAGE_SIZE 0x2000
#define EGA_PLANES 4

#define EGA_WIDTH_POT 512
#define EGA_HEIGHT_POT 256

/// "SBOL" strings are a sequence of characters terminated by a negative, using
/// this encoding:
///    0-9: digits
///    10-35: letters
///    36: '!'
///    37: ' '
///    38: 'c' (copyright symbol)
///    extra icons
typedef int8_t SBOL;

#define SBOL_0 0
#define SBOL_A 10
#define SBOL_Z 35
#define SBOL_SPACE 37
#define SBOL_END -1

#define SB(x)                                          \
  ((x) == ' '              ? SBOL_SPACE                \
       : (x) <= '9'        ? (x) - '0'                 \
       : ((x) | 32) <= 'z' ? SBOL_A + ((x) | 32) - 'a' \
                           : -1)

/// A pair of SBOL string and a screen offset.
/// A sequence of these ends with a null string pointer.
typedef struct SBOLDesc {
  const SBOL *str;
  unsigned offset;
} SBOLDesc;

#define NUM_SPRITES 48
#define SPRITE_W 1
#define SPRITE_H 7

typedef struct {
  int8_t x;
  int8_t y;
} StepXY;

/// Step for every magnitude [0..5] and every direction [0..7].
// clang-format off
static const StepXY step_xy[6][8] = {
  // N        NE       E       SE      S       SW        W        NW
  {{0,  0}, {0,  0}, {0, 0}, {0, 0}, {0, 0}, {0,  0}, { 0, 0}, { 0,  0}},
  {{0, -1}, {1, -1}, {1, 0}, {1, 1}, {0, 1}, {-1, 1}, {-1, 0}, {-1, -1}},
  {{0, -2}, {2, -2}, {2, 0}, {2, 2}, {0, 2}, {-2, 2}, {-2, 0}, {-2, -2}},
  {{0, -3}, {3, -3}, {3, 0}, {3, 3}, {0, 3}, {-3, 3}, {-3, 0}, {-3, -3}},
  {{0, -4}, {4, -4}, {4, 0}, {4, 4}, {0, 4}, {-4, 4}, {-4, 0}, {-4, -4}},
  {{0, -5}, {5, -5}, {5, 0}, {5, 5}, {0, 5}, {-5, 5}, {-5, 0}, {-5, -5}},
};
// clang-format on

static uint8_t level;
static uint8_t density;
/// Score as a SBol string.
static SBOL strb_score[7] =
    {SBOL_SPACE, SBOL_SPACE, SBOL_SPACE, SBOL_SPACE, SBOL_SPACE, SBOL_0, SBOL_END};
/// High score as a string
static SBOL strb_hisco[7] =
    {SBOL_SPACE, SBOL_SPACE, SBOL_SPACE, SBOL_SPACE, SBOL_SPACE, SBOL_0, SBOL_END};
/// Level of the high score.
static uint8_t high_level;
/// Density of the high score
static uint8_t high_dens;
/// Increments every 54.94 ms
static uint8_t time_tick;
/// I believe this is used to keep the random generator state.
static uint8_t rnd_state[32] = {0x0B, 0xED, 0x5F, 0x8F, 0xB5, 0x3B, 0xE3, 0x73, 0x67, 0x23, 0x6D,
                                0x11, 0xBD, 0xA5, 0xF3, 0xDF, 0x71, 0x2B, 0x77, 0x85, 0xE5, 0x37,
                                0xAB, 0xEF, 0xF7, 0xD5, 0x0F, 0x51, 0xEB, 0xF3, 0x2B, 0xC3};

/// This value is always in the range 0..31. It is occasionally updated with
/// the current tick with some offset.
static uint8_t time_5bit;
#define TIME_5BIT_MASK 0x1F

#define MAZE_WIDTH 64
#define MAZE_HEIGHT 64
#define MAZE_STRIDE 64

// Wall flags: top, right, bottom, left
// Flags all always symmetrical in neighbouring cells: a right wall in cell X
// must be followed by a left wall in cell X + 1, etc.
#define W_L 1
#define W_T 2
#define W_R 4
#define W_B 8
#define W_NO 0
#define W_ALL 0x0F

static uint8_t _ext_alist_buf[2 + MAZE_HEIGHT * MAZE_WIDTH];
/// A 64x64 buffer containing the head of list of actors in each cell. 0 means
/// EOL.
/// It starts two bytes in to protect against negative indices.
#define alist_buf (_ext_alist_buf + 2)
/// The code relies on out of range access to maze_buf (indices -1 and -2), so
/// we reserve two extra bytes in the beginning.
static uint8_t _ext_maze_buf[2 + MAZE_HEIGHT * MAZE_WIDTH];
/// A 64x64 buffer. It starts two bytes in to protect against negative indices.
#define maze_buf (_ext_maze_buf + 2)

/// Destination segment for graphics writes.
static unsigned dest_seg; // 4F8Ah

/// The size in pixels of one cell.
#define CELL_SIZE 38

#define MAZE_SCREEN_W 208
#define MAZE_SCREEN_H 191

#define NUM_ACTORS 42

/// The cell of the ship.
static uint8_t ship_cellx[NUM_ACTORS];
/// The cell of the ship.
static uint8_t ship_celly[NUM_ACTORS];
/// Offset of the ship within the cell.
static int8_t ship_ofsx[NUM_ACTORS];
/// Offset of the ship within the cell.
static int8_t ship_ofsy[NUM_ACTORS];
/// Collision flags.
static uint8_t coll_flags1[NUM_ACTORS];
/// Unknown.
static uint8_t var_188e[NUM_ACTORS]; // 506Dh
/// Unknown.
static uint8_t var_189e[32]; // 5097h
/// Ship velocity magnitude [0..5]
static uint8_t vel_magn[32]; // 50B7h
/// Ship angle [0..7]. N, NE, E, SE, S, SW, W, NW.
static uint8_t ship_angle[32]; // 50D7h
/// This looks like an index of the next element. 0 means EOL.
static int8_t next_actor[32]; // 50F7h
/// Absolute gun angle [0..7].
static uint8_t gun_angle; // 5177h
/// The angle of the ship velocity relative to the ship angle:
/// It is either 0 or 4 (when moving backwards).
static uint8_t vel_angle; // 5178h
/// Bullet x-coordinate, screen-relative.
static uint8_t bullet_x[32]; // 5179h
/// Bullet 8-coordinate, screen-relative.
static uint8_t bullet_y[32]; // 5199h
/// Bullet flags.
/// 0xFF (or likely 0x80) if out of screen.
/// 0x06 if collision.
static uint8_t bullet_flags[32]; // 51B9h
/// Angle of the moving bullet.
static uint8_t bullet_angle[32]; // 51D9h

/// Not completely sure what this is yet, but it is a 32-byte array and element
/// 0 is incremented by 2 when we press the fire button. Theory: this has to do with
/// actors (0 being the ship) firing.
static uint8_t maybe_fire[32]; // 51F9h

static struct {
  uint8_t var_194e[6]; // 521Ah
  uint8_t var_195e[6]; // 5220h
  uint8_t var_196e[6]; // 5226h
  uint8_t var_197e[18]; // 522Ch
} un1;
static uint16_t var_198e; // 523Eh

static void draw_rect(unsigned seg, unsigned x, unsigned y, unsigned wm1, unsigned hm1);
static void draw_bolo_8x20(unsigned offset);
static void vert_line(unsigned seg, unsigned x, unsigned y, unsigned lenm1);
static void horiz_line(unsigned seg, unsigned x, unsigned y, unsigned lenm1);
static void draw_mstrs(const SBOLDesc *strings);
static void draw_str(unsigned offset, const SBOL *str);
static void draw_char_1x7(unsigned offset, SBOL ch);
static void shoot_bullet(unsigned actor);
static inline bool in_screen(uint8_t x, uint8_t y);

typedef struct {
  /// The "signedness" of the resulting 8-bit values is tricky. They are declared
  /// as unsigned, but their real values are in the following ranges:
  /// x = [-48..255]
  /// y = [-60..255]
  /// Obviously there is overlap. I believe the overlap is resolved by relying
  /// on the screen size 208x191. Values above 208 and 191 respectively are
